app/Controllers/BukuController.php

    public function delete($id)
    {
        $bukuModel = new BukuModel();
        if ($bukuModel->delete($id)) {
---
DELETE FROM `tb_buku`
WHERE `id` IN ('9')