app/Controllers/InputController.php

    public function store()
    {
        $bukuModel = new BukuModel();
        $sampul = $this->request->getFile('foto');

        if ($sampul && $sampul->isValid() && !$sampul->hasMoved()) {
            $newName = $sampul->getRandomName();
            $sampul->move(WRITEPATH . 'uploads', $newName);

            $data = [
                'judul' => $this->request->getPost('judul'),
                'sinopsis' => $this->request->getPost('sinopsis'),
                'penulis_id' => $this->request->getPost('penulis_id'),
                'penerbit_id' => $this->request->getPost('penerbit_id'),
                'tahun' => $this->request->getPost('tahun'),
                'jumlah' => $this->request->getPost('jumlah'),
                'kategori_id' => $this->request->getPost('kategori_id'),
                'loker_buku' => $this->request->getPost('loker_buku'),
                'sampul' => $newName
            ];

            $bukuModel->insert($data);
---
INSERT INTO `tb_buku` (`judul`, `sinopsis`, `penulis_id`, `penerbit_id`, `tahun`, `jumlah`, `kategori_id`, `loker_buku`, `sampul`) VALUES ('tes', '', '1', '1', '', '', '1', '', '1717054542_7b7f265f33a1886dac62.png')

    public function storekategori(){
        $kategoriModel = new KategoriModel;

        $data = [
            'nama' =>  $this->request->getpost('kategori')
        ];
        $kategoriModel->insert($data);
---
INSERT INTO `tb_kategori` (`nama`) VALUES ('Panduan')