app/Controllers/PeminjamanController.php

SELECT *
FROM `tb_user`
SELECT *
FROM `tb_buku`
---
    public function create()
    {
        $userModel = new UserModel();
        $bukuModel = new BukuModel();

        $data['users'] = $userModel->findAll();
        $data['bukus'] = $bukuModel->findAll();

INSERT INTO `tb_peminjaman` (`user_id`, `buku_id`, `jumlah_buku`, `tgl_pinjam`, `batas_waktu`, `status`, `denda`) VALUES ('1', '1', '', '', '2024-06-06', 'Dipinjam', 0)
---
    public function store()
    {
        $peminjamanModel = new PeminjamanModel();

        $data = [
            'user_id' => $this->request->getPost('user_id'),
            'buku_id' => $this->request->getPost('buku_id'),
            'jumlah_buku' => $this->request->getPost('jumlah_buku'),
            'tgl_pinjam' => $this->request->getPost('tgl_pinjam'),
            'batas_waktu' => $this->calculateBatasWaktu($this->request->getPost('tgl_pinjam')),
            'status' => 'Dipinjam',
            'denda' => 0
        ];
        if ($peminjamanModel->insert($data)) {

SELECT *
FROM `tb_peminjaman`
WHERE `tb_peminjaman`.`id` = '12'
UPDATE `tb_peminjaman` SET `tgl_kembali` = '2024-06-12', `status` = 'Kembali', `denda` = 6000
WHERE `tb_peminjaman`.`id` IN ('12')
---
    public function return()
    {
        $peminjamanModel = new PeminjamanModel();

        $data = [
            'tgl_kembali' => $this->request->getPost('tgl_kembali'),
            'status' => 'Kembali',
        ];

        // Cari peminjaman berdasarkan ID
        $peminjaman = $peminjamanModel->find($this->request->getPost('peminjaman_id'));

        // Hitung denda jika ada keterlambatan
        if (new DateTime($data['tgl_kembali']) > new DateTime($peminjaman['batas_waktu'])) {
            $data['denda'] = $this->calculateDenda($peminjaman['batas_waktu'], $data['tgl_kembali']);
        } else {
            $data['denda'] = 0;
        }

        // Update data peminjaman
        $peminjamanModel->update($this->request->getPost('peminjaman_id'), $data);

SELECT `tb_peminjaman`.`id`, `tb_buku`.`judul` as `judul_buku`, `tb_user`.`nama` as `nama_user`, `tb_peminjaman`.`tgl_pinjam`
FROM `tb_peminjaman`
JOIN `tb_user` ON `tb_user`.`id` = `tb_peminjaman`.`user_id`
JOIN `tb_buku` ON `tb_buku`.`id` = `tb_peminjaman`.`buku_id`
WHERE `status` = 'Dipinjam'
---
    public function createReturn()
    {
        $peminjamanModel = new PeminjamanModel();

        $peminjamans = $peminjamanModel->select('tb_peminjaman.id, tb_buku.judul as judul_buku, tb_user.nama as nama_user, tb_peminjaman.tgl_pinjam')
            ->join('tb_user', 'tb_user.id = tb_peminjaman.user_id')
            ->join('tb_buku', 'tb_buku.id = tb_peminjaman.buku_id')
            ->where('status', 'Dipinjam')
            ->findAll();