app/Controllers/UserController.php

   public function library()
    {
        $bukumodel = new BukuModel;
        $buku = $bukumodel->findAll();
---
SELECT *
FROM `tb_buku`