app/Models/BukuModel.php

SELECT `tb_buku`.*, `tb_penulis`.`nama` as `penulis_nama`, `tb_penebit`.`nama` as `penebit_nama`, `tb_kategori`.`nama` as `kategori_nama`
FROM `tb_buku`
JOIN `tb_penulis` ON `tb_penulis`.`id` = `tb_buku`.`penulis_id`
JOIN `tb_penebit` ON `tb_penebit`.`id` = `tb_buku`.`penerbit_id`
JOIN `tb_kategori` ON `tb_kategori`.`id` = `tb_buku`.`kategori_id`
---
    public function getBukuWithRelations()
    {
        return $this->select('tb_buku.*, tb_penulis.nama as penulis_nama, tb_penebit.nama as penebit_nama, tb_kategori.nama as kategori_nama')
                    ->join('tb_penulis', 'tb_penulis.id = tb_buku.penulis_id')
                    ->join('tb_penebit', 'tb_penebit.id = tb_buku.penerbit_id')
                    ->join('tb_kategori', 'tb_kategori.id = tb_buku.kategori_id')
                    ->findAll();