app/Models/PeminjamanModel.php

    public function getPeminjamanWithRelations()
    {
        return $this->select('tb_peminjaman.*, tb_user.nama as user_nama, tb_buku.judul as buku_nama')
                    ->join('tb_user', 'tb_user.id = tb_peminjaman.user_id')
                    ->join('tb_buku', 'tb_buku.id = tb_peminjaman.buku_id')
                    ->findAll();
---
SELECT `tb_peminjaman`.*, `tb_user`.`nama` as `user_nama`, `tb_buku`.`judul` as `buku_nama`
FROM `tb_peminjaman`
JOIN `tb_user` ON `tb_user`.`id` = `tb_peminjaman`.`user_id`
JOIN `tb_buku` ON `tb_buku`.`id` = `tb_peminjaman`.`buku_id`