app/Models/User.php

SELECT *
FROM `tb_user`
WHERE `username` = 'pariskun'
 LIMIT 1
---
    public function getUserByUsername($username)
    {
        return $this->where('username', $username)->first();